In [3]:
# import liabraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn import datasets
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics  import classification_report

In [4]:
# import data
data = pd.read_csv("D:/DATA SCIENCE/1. Data Scientist/Assignment/13. decision tree/Fraud_check.csv")

In [5]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Undergrad        600 non-null    object
 1   Marital.Status   600 non-null    object
 2   Taxable.Income   600 non-null    int64
 3   City.Population  600 non-null    int64
 4   Work.Experience  600 non-null    int64
 5   Urban            600 non-null    object
dtypes: int64(3), object(3)
memory usage: 28.2+ KB

In [7]:
data.shape

(600, 6)

In [8]:
data.describe()

       Taxable.Income  City.Population  Work.Experience
count      600.000000       600.000000       600.000000
mean     55208.375000    108747.368333        15.558333
std      26204.827597     49850.075134         8.842147
min      10003.000000     25779.000000         0.000000
25%      32871.500000     66966.750000         8.000000
50%      55074.500000    106493.500000        15.000000
75%      78611.750000    150114.250000        24.000000
max      99619.000000    199778.000000        30.000000

In [9]:
label_encoder = preprocessing.LabelEncoder()
data[' Undergrad ']=label_encoder.fit_transform(data['Undergrad'])
data[' Marital.Status']=label_encoder.fit_transform(data['Marital.Status'])
data[' Urban']=label_encoder.fit_transform(data['Urban'])

In [10]:
data.head()

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban,Undergrad,Marital.Status,Urban
0,NO,Single,68833,50047,10,YES,0,2,1
1,YES,Divorced,33700,134075,18,YES,1,0,1
2,NO,Married,36925,160205,30,YES,0,1,1
3,YES,Single,50190,193264,15,YES,1,2,1
4,NO,Married,81002,27533,28,NO,0,1,0

In [11]:
data['Undergrad'].unique()

array(['NO', 'YES'], dtype=object)

In [12]:
data['Marital.Status'].unique()

array(['Single', 'Divorced', 'Married'], dtype=object)

In [13]:
data['Urban'].unique()

array(['YES', 'NO'], dtype=object)

In [14]:
data1 = data.drop(['Undergrad','Marital.Status','Urban'],axis=True)

In [15]:
data1.head()

,Taxable.Income,City.Population,Work.Experience,Undergrad,Marital.Status,Urban
0,68833,50047,10,0,2,1
1,33700,134075,18,1,0,1
2,36925,160205,30,0,1,1
3,50190,193264,15,1,2,1
4,81002,27533,28,0,1,0

In [ ]:
# by another step
#Creating dummy vairables for these three categorical column & dropping first dummy variable
data = pd.get_dummies(data,columns=['Undergrad','Marital.Status','Urban'], drop_first=True)

In [17]:
#Creating new cols TaxInc and dividing 'Taxable.Income' cols on the basis of [10002,30000,99620] for Risky and Good
data1["TaxInc"] = pd.cut(data1["Taxable.Income"], bins = [10003,30000,99619], labels = ["Risky", "Good"])

In [18]:
data1.head()

,Taxable.Income,City.Population,Work.Experience,Undergrad,Marital.Status,Urban,TaxInc
0,68833,50047,10,0,2,1,Good
1,33700,134075,18,1,0,1,Good
2,36925,160205,30,0,1,1,Good
3,50190,193264,15,1,2,1,Good
4,81002,27533,28,0,1,0,Good

In [19]:
#After creation of new col. TaxInc also made its dummies var concating right side of df
data1 = pd.get_dummies(data1,columns = ["TaxInc"],drop_first=True)

In [20]:
data1.head()

,Taxable.Income,City.Population,Work.Experience,Undergrad,Marital.Status,Urban,TaxInc_Good
0,68833,50047,10,0,2,1,1
1,33700,134075,18,1,0,1,1
2,36925,160205,30,0,1,1,1
3,50190,193264,15,1,2,1,1
4,81002,27533,28,0,1,0,1

In [21]:
# Normalizing data, 
def norm_func(i): 
    x = (i-i.min())/(i.max()-i.min()) 
    return (x)

In [22]:
# Normalized data frame
data_norm = norm_func(data1.iloc[:,1:])
data_norm.head(10)

,City.Population,Work.Experience,Undergrad,Marital.Status,Urban,TaxInc_Good
0,0.139472,0.333333,0.0,1.0,1.0,1.0
1,0.622394,0.600000,1.0,0.0,1.0,1.0
2,0.772568,1.000000,0.0,0.5,1.0,1.0
3,0.962563,0.500000,1.0,1.0,1.0,1.0
4,0.010081,0.933333,0.0,0.5,0.0,1.0
5,0.520710,0.000000,0.0,0.0,0.0,1.0
6,0.316732,0.266667,0.0,0.0,1.0,1.0
7,0.606176,0.100000,1.0,1.0,1.0,1.0
8,0.440819,0.400000,0.0,1.0,1.0,1.0
9,0.745424,0.133333,1.0,0.0,1.0,1.0

In [23]:
# declaring feature and target
array = data_norm.values
x = array[:,0:5]
y = array[:,-1]

In [24]:
x

array([[0.13947207, 0.33333333, 0.        , 1.        , 1.        ],
       [0.62239438, 0.6       , 1.        , 0.        , 1.        ],
       [0.77256766, 1.        , 0.        , 0.5       , 1.        ],
       ...,
       [0.73723987, 0.        , 0.        , 0.        , 1.        ],
       [0.88680969, 0.56666667, 1.        , 0.5       , 0.        ],
       [0.76068253, 0.53333333, 0.        , 0.        , 0.        ]])

In [25]:
y

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 1., 0.,
       1., 1., 0., 1., 0., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1.,
       0., 1., 0., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1.,
       1., 1., 0., 1., 0., 1., 1., 0., 1., 1., 0., 1., 1., 1., 1., 1., 1.,
       0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1.,
       0., 1., 0., 1., 0., 1., 1., 1., 0., 0., 1., 0., 1., 0., 1., 1., 1.,
       1., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1., 1., 0., 1., 1., 1., 0.,
       1., 1., 0., 0., 0., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 0.,
       1., 0., 1., 1., 0., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 0.,
       0., 0., 1., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 1., 1., 0., 1.,
       1., 0., 0., 1., 1., 1., 1., 1., 1., 0., 1., 0., 0., 1., 1., 1., 1.,
       1., 0., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 0., 1., 1., 1., 1.,
       0., 0., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1.,
       1., 1., 1., 1., 1., 1., 1., 0., 1., 0., 1., 0., 0., 1., 1., 1., 0.,
       1., 1., 1., 0., 1., 1., 1., 1., 1., 0., 0., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 1., 0., 1., 1., 1., 0.,
       1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 0., 0., 1., 0., 1., 0., 1., 0., 1., 1., 1., 0., 0., 0.,
       1., 1., 1., 1., 1., 1., 0., 0., 1., 0., 1., 1., 0., 1., 0., 1., 0.,
       0., 1., 1., 1., 1., 0., 0., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 0., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 0., 1., 1., 1., 1., 0., 0., 1., 1., 0., 0., 0., 1., 1.,
       1., 0., 0., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 0.,
       0., 1., 1., 0., 1., 1., 0., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 0., 1.,
       0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 0.,
       1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 0., 1., 0.,
       1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 0., 0., 1., 1.,
       0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1.,
       1., 1., 1., 1., 1.])

In [26]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.8, random_state= 1)

In [29]:
# Creating model testing 
from sklearn.ensemble import RandomForestClassifier
forest_new = RandomForestClassifier(n_estimators=80,max_depth=10,min_samples_split=15,criterion='gini')  # n_estimators is the number of decision trees
forest_new.fit(x_train, y_train)

RandomForestClassifier(max_depth=10, min_samples_split=15, n_estimators=80)

In [30]:
print('Train accuracy: {}'.format(forest_new.score(x_train, y_train)))
print('Test accuracy: {}'.format(forest_new.score(x_test, y_test)))

Train accuracy: 0.825
Test accuracy: 0.7875